/*────────────────────────────────────────────────────────────────────────────────────────────────*/

class API {
// Источник по умолчанию
    static defaultSource = '';
    
// Список источников
    static sources = new Map();
    
/*┌──────────────────────────────────────────────┐
  │ Добавляет новый источник в список источников │
  └──────────────────────────────────────────────┘*/
    static addSource(source = '', instance) {
    // Добавляем новый источник в список источников
        this.sources.set(source, instance);
        
    // Сохраняем как источник по умолчанию
        this.defaultSource = source;
    }
    
/*┌──────────────────────────────┐
  │ Задает источник по умолчанию │
  └──────────────────────────────┘*/
    static setDefaultSource(source = '') {
        this.defaultSource = source || this.defaultSource;
    }
    
/*┌──────────────────────────────────┐
  │ Возвращает пользователя по ключу │
  └──────────────────────────────────┘*/
    static getUser(key = '', source = '') {
    // Получаем текущий источник
        source = this.sources.get(source || this.defaultSource);
        
    // Возвращаем пользователя по ключу
        return source.getUser(key);
    }
}

/*────────────────────────────────────────────────────────────────────────────────────────────────*/