/*────────────────────────────────────────────────────────────────────────────────────────────────*/

window.addEventListener('load', () => {
// Добавляем источники
    API.addSource('ph', new Telegraph);
    
// Задаем источник по умолчанию
    API.setDefaultSource('ph');
    
// Получаем ключ
    let key = 'XXX';
    
// Получаем пользователя по ключу
    API.getUser(key)
    
// Данные получены успешно
    .then((res) => {
        _=['good1', res]
    })
    
// Ошибка при получении данных
    .catch((error) => {
        console.log(error);
        _=error
    });
});

/*────────────────────────────────────────────────────────────────────────────────────────────────*/